---
kind: type
id: T:Autodesk.Revit.DB.ImageInstance
source: html/ff77d6c8-a94a-067a-cd95-4f2cd3ec8dcc.htm
---
# Autodesk.Revit.DB.ImageInstance

An element that represents an instance of an image placed in a view

## Syntax (C#)
```csharp
public class ImageInstance : Element
```